# command-line utilities

brew "docker"
brew "fnm"
brew "gh"
brew "git-secrets"
brew "git"
brew "llm"
brew "pnpm"
brew "tree"
brew "yadm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# applications

cask "browserosaurus"
cask "chatgpt"
cask "cursor"
cask "discord"
cask "google-chrome"
cask "iterm2"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "windsurf"
cask "zed"

# vs code extensions

vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "ms-azuretools.vscode-docker"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jayvicsanantonio.barbenheimer"
vscode "mgmcdermott.vscode-language-babel"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "yechunan.json-color-token"
